package com.edison.project.domain.space.service;

import com.edison.project.domain.space.dto.WordResultDto;
import com.edison.project.domain.space.entity.Dataset;
import com.edison.project.domain.space.repository.DatasetRepository;
import org.springframework.beans.factory.annotation.Value;
import org.springframework.core.io.ClassPathResource;
import org.springframework.stereotype.Service;
import org.springframework.transaction.annotation.Transactional;
import org.w3c.dom.*;

import javax.xml.crypto.Data;
import javax.xml.parsers.DocumentBuilder;
import javax.xml.parsers.DocumentBuilderFactory;
import java.io.BufferedReader;
import java.io.InputStream;
import java.io.InputStreamReader;
import java.net.URL;
import java.net.URLConnection;
import java.net.URLEncoder;
import java.nio.charset.StandardCharsets;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

@Service
public class StdicService {

    private final String apiKey;
    private final String apiUrl;
    private final DatasetRepository datasetRepository;

    public StdicService(
            @Value("${stdict.api.key}") String apiKey,
            @Value("${stdict.api.url}") String apiUrl, DatasetRepository datasetRepository) {
        this.apiKey = apiKey;
        this.apiUrl = apiUrl;
        this.datasetRepository = datasetRepository;
    }

    @Transactional
    public List<WordResultDto> searchWord(String query) {
        List<WordResultDto> results = new ArrayList<>();
        try {
            String url = apiUrl + "?key=" + apiKey + "&q=" + URLEncoder.encode(query, StandardCharsets.UTF_8)
                    + "&type_search=search";

            DocumentBuilderFactory dbf = DocumentBuilderFactory.newInstance();
            DocumentBuilder db = dbf.newDocumentBuilder();
            URL urlObj = new URL(url);
            URLConnection conn = urlObj.openConnection();
            conn.setRequestProperty("Accept-Charset", "UTF-8");

            Document doc;
            try (InputStream stream = conn.getInputStream()) {
                doc = db.parse(stream);
            }

            NodeList nl = doc.getElementsByTagName("item");

            for (int i = 0; i < nl.getLength(); i++) {
                Node node = nl.item(i);
                if (node.getNodeType() == Node.ELEMENT_NODE) {
                    Element element = (Element) node;

                    WordResultDto wr = new WordResultDto(
                            getValue("word", element),
                            getValueNullable("pos", element),
                            getValueNullable("definition", element),
                            getValueNullable("example", element)
                    );
                    results.add(wr);
                }
            }
        } catch (Exception e) {
            e.printStackTrace();
        }
        return results;
    }

    public List<WordResultDto> searchAndSave(String word) {
        List<WordResultDto> results = searchWord(word);

        for (WordResultDto r : results) {
            String content = r.getWord() + " : " + r.getDefinition();
            if (r.getExample() != null) {
                content += " / " + r.getExample();
            }
            Dataset dataset = new Dataset(content, "dictionary");
            Dataset saved = datasetRepository.save(dataset);
            datasetRepository.flush();

            System.out.println("Saved dataset: ID=" + saved.getId() + ", content=" + content);
        }

        return results;
    }

    private static String getValue(String tag, Element element) {
        NodeList nl = element.getElementsByTagName(tag).item(0).getChildNodes();
        Node value = nl.item(0);
        return value.getNodeValue();
    }

    private static String getValueNullable(String tag, Element element) {
        NodeList list = element.getElementsByTagName(tag);
        if (list.getLength() == 0) return null;

        String value = list.item(0).getTextContent();
        if (value == null || value.isEmpty()) return "";

        return value.trim();
    }


    public List<String> getATierWords() {
        return Arrays.asList(
                "가게", "가깝다", "가끔", "가다01", "가다01", "가르치다01", "가방01", "가볍다",
                "가수11", "가슴01", "가운데", "가을01", "가장01", "가져오다", "가족01", "가지다",
                "가지다", "간호사", "갈비01", "감기04", "감사08", "감사하다05", "감사하다05",
                "갑자기", "값", "강01", "같다", "같이", "개03", "개10", "개월", "거01", "거01",
                "거기01", "거리01", "거울01", "걱정", "걱정하다", "건강03", "건강하다02", "건물03",
                "걷다02", "걸다02", "걸어가다", "걸어오다01", "검은색", "것01", "게임", "겨울",
                "결혼", "결혼식", "결혼하다", "경복궁", "경주", "경찰04", "경찰관", "경찰서",
                "경치02", "계란", "계속04", "계시다", "계시다", "계절01", "계획01", "고기01",
                "고등학교", "고등학생", "고맙다01", "고양이", "고프다", "고향02", "곧01", "곳01",
                "공01", "공부01", "공부하다", "공원03", "공중전화", "공책01", "공항02", "공휴일",
                "과10", "과일01", "과자02", "괜찮다", "교과서", "교수06", "교실", "교통01", "교회02",
                "구01", "구경01", "구두01", "구름01", "구십", "구월02", "군인", "권01", "귀01",
                "그01", "그01", "그02", "그거", "그것", "그곳", "그날", "그동안", "그때", "그래01",
                "그래03", "그래서", "그래서", "그러나", "그러니까", "그러면", "그런데", "그럼01",
                "그럼02", "그렇다", "그렇지만", "그릇01", "그리고", "그리다02", "그림01", "그분",
                "그쪽", "극장", "근처", "금요일", "급04", "기다리다", "기분01", "기숙사", "기차01",
                "길01", "길다02", "김밥", "김치01", "깎다", "깨끗하다", "꼭03", "꽃01", "꿈01",
                "끄다01", "끝01", "끝나다", "끝내다", "나03", "나가다", "나가다", "나다01", "나라01",
                "나무01", "나쁘다01", "나오다", "나이01", "나중01", "날01", "날다01", "날씨01",
                "날짜01", "남녀", "남대문", "남대문시장", "남동생", "남자02", "남쪽", "남편01",
                "남학생", "낮", "낮다", "내년", "내다02", "내다02", "내려가다", "내려오다", "내리다01",
                "내일", "내일", "냉면", "냉장고", "너01", "너무01", "넓다", "넣다", "네02", "네03",
                "넥타이", "넷01", "넷째", "넷째", "년02", "노란색", "노래01", "노래하다", "노트02",
                "놀다01", "놀라다", "높다", "놓다01", "놓다01", "누구", "누나01", "눈01", "눈04",
                "눈물01", "뉴스", "늦다", "늦다", "다03", "다03", "다녀오다", "다니다", "다르다01",
                "다른", "다리01", "다리02", "다섯", "다섯째", "다섯째", "다시01", "다음01", "닦다01",
                "단어", "닫다02", "달05", "달05", "달다07", "달러", "달러", "달력", "닭", "닭고기",
                "담배", "대답", "대답하다", "대사관", "대학01", "대학교", "대학생", "대화06", "댁01",
                "더01", "덥다01", "도서관", "도시03", "도와주다", "도착01", "도착하다01", "독일", "돈01",
                "돌아가다", "돌아오다", "돕다", "동물", "동생01", "동안01", "동쪽", "돼지", "돼지고기",
                "되다01", "두01", "둘01", "둘째", "둘째", "뒤01", "드리다01", "드리다01", "듣다01",
                "들다01", "들다04", "들어가다01", "들어오다", "등산", "따뜻하다", "딸01", "딸기", "때01",
                "때문", "떠나다", "떡01", "또", "똑같다", "똑바로", "뛰다01", "뛰다02", "뜨겁다",
                "라디오", "라면01", "러시아", "마리01", "마시다", "마음01", "마지막", "마흔", "만06",
                "만06", "만나다", "만들다", "많다", "많이", "말01", "말다03", "말다03", "말씀",
                "말씀하다", "말하다", "맑다01", "맛01", "맛없다", "맛있다", "매우01", "매일", "매일",
                "맥주", "맵다", "머리01", "먹다02", "먹다02", "먼저", "멀다02", "메뉴", "며칠", "명03",
                "몇", "몇", "모두01", "모두01", "모든", "모르다", "모자08", "목01", "목요일", "목욕",
                "몸01", "못04", "못하다", "못하다", "못하다", "무겁다", "무슨", "무엇", "문05", "문제06",
                "묻다03", "물01", "물건", "물론01", "물어보다", "뭐", "뭐", "미국", "미안하다",
                "미터02", "밑01", "바꾸다", "바나나", "바다", "바람01", "바람01", "바로02", "바쁘다",
                "바지01", "박물관", "밖", "반07", "반11", "반갑다", "받다01", "발01", "발음01",
                "밝다", "밤01", "밥01", "방07", "방학", "배01", "배02", "배03", "배고프다",
                "배부르다", "배우다01", "백05", "백05", "백화점", "버리다01", "버스02", "번04",
                "번호02", "벌써", "벗다", "별01", "병04", "병05", "병원02", "보내다", "보다01",
                "보다01", "보다02", "보통", "복잡하다", "볼펜02", "봄01", "부르다01", "부모01",
                "부모님", "부부03", "부산", "부엌", "부인01", "북쪽", "분01", "분08", "불01",
                "불고기", "불다01", "비01", "비누", "비디오", "비빔밥", "비슷하다02", "비싸다",
                "비행기", "빠르다", "빨간색", "빨리", "빵01", "사11", "사과05", "사다", "사람",
                "사랑01", "사랑하다", "사무실", "사십", "사용하다03", "사월02", "사이01", "사장15",
                "사전22", "사진07", "사탕02", "산01", "산책", "살04", "살다01", "삼06", "삼십",
                "삼월", "새03", "새06", "색03", "색깔", "샌드위치", "생각01", "생각하다", "생기다",
                "생선", "생일02", "생활", "샤워", "서다01", "서로01", "서른", "서울", "서울역",
                "서점03", "서쪽", "선물03", "선물하다", "선생01", "선생님", "설명", "설명하다",
                "설악산", "설탕", "세01", "세13", "세수04", "세탁기", "센티미터", "셋", "셋째",
                "셋째", "소개하다01", "소금01", "소파06", "소풍02", "속01", "손01", "손가락",
                "손님", "쇠고기", "쇼핑", "수02", "수건", "수박01", "수업04", "수영02", "수영장",
                "수요일", "숙제03", "숟가락", "술01", "술06", "쉬다03", "쉰", "쉽다", "슈퍼마켓",
                "스무", "스물", "스키", "스트레스", "스포츠", "슬프다", "시06", "시10", "시간04",
                "시간04", "시계01", "시원하다", "시월01", "시작01", "시작되다01", "시작하다01",
                "시장04", "시험03", "식당", "식사03", "식사하다02", "식탁", "신다", "신문10",
                "신발", "실례01", "실례하다", "싫다01", "싫어하다", "십", "십이월", "십일월", "싶다",
                "싸다05", "싸우다", "쓰다01", "쓰다02", "쓰다03", "쓰레기", "씨07", "씻다", "아02",
                "아기01", "아내01", "아니01", "아니다", "아니요", "아들", "아래01", "아름답다",
                "아마01", "아무01", "아무01", "아버지", "아빠", "아이01", "아이스크림", "아저씨",
                "아주01", "아주머니", "아줌마", "아직01", "아침", "아파트", "아프다", "아홉", "아흔",
                "안01", "안02", "안경03", "안녕", "안녕하다", "안녕히", "안다01", "안되다01",
                "앉다", "않다", "않다", "알다", "앞", "야구02", "약07", "약국02", "약속", "약속하다",
                "양말01", "양복01", "얘기", "얘기하다", "어02", "어깨01", "어느01", "어디01",
                "어디01", "어떠하다", "어떤", "어떻다", "어렵다", "어른01", "어린이01", "어머니01",
                "어서01", "어제01", "어제01", "언니", "언제01", "언제01", "언제나", "얼굴01", "얼마",
                "얼마나", "엄마", "없다01", "에어컨", "여권02", "여기01", "여덟", "여동생", "여든",
                "여러", "여러분", "여름01", "여보세요", "여섯", "여자02", "여학생", "여행02",
                "여행하다01", "역14", "역사04", "연습03", "연습하다03", "연필", "열03", "열다02",
                "열쇠", "열심히", "영국", "영어02", "영화01", "옆", "예06", "예쁘다", "예순", "옛날",
                "오04", "오늘", "오늘", "오다01", "오다01", "오래02", "오래간만", "오랜만", "오렌지",
                "오르다", "오른쪽", "오빠", "오십", "오월01", "오전02", "오후02", "올라가다", "올해",
                "옷01", "왜02", "왜냐하면", "외국02", "외국어", "외국인", "왼쪽", "요리05", "요리하다02",
                "요일", "요즈음", "요즘", "우리03", "우리나라", "우산01", "우유02", "우체국",
                "운동02", "운동장", "운동하다", "운동화", "운전02", "운전하다", "울다01", "웃다",
                "원01", "월02", "월요일", "위01", "위험", "위험하다", "유명하다01", "유월01", "육02",
                "육십", "은행02", "음식", "음악01", "의사12", "의자03", "이03", "이05", "이05",
                "이09", "이거01", "이것", "이곳", "이때", "이런01", "이렇다", "이름", "이번01",
                "이분01", "이십", "이야기", "이야기하다", "이월01", "이제01", "이제01", "이쪽02",
                "이해하다02", "인사01", "인사02", "인사하다", "인천", "일01", "일05", "일07", "일곱",
                "일본", "일본어", "일어나다", "일요일", "일월01", "일주일", "일찍", "일하다", "일흔",
                "읽다", "잃다", "잃어버리다", "입", "입다01", "있다01", "있다01", "있다01", "잊다01",
                "잊어버리다", "잎01", "자다01", "자동차", "자리01", "자장면", "자전거", "자주01",
                "작년", "작다01", "잔03", "잘02", "잘하다", "잠01", "잠깐", "잠깐", "잠시", "잠자다",
                "잡다01", "잡수시다", "잡지", "장22", "장미05", "장소05", "재미01", "재미없다",
                "재미있다", "저03", "저04", "저04", "저거01", "저것", "저곳", "저기01", "저녁",
                "저쪽", "적다01", "적다02", "전08", "전08", "전화07", "전화번호", "전화하다02",
                "점심", "점심시간", "젓가락", "정류장", "정말01", "제일04", "제주도", "조금01",
                "조금01", "조용하다01", "졸업", "졸업하다", "좀02", "종이01", "좋다01", "좋아하다",
                "죄송하다", "주26", "주26", "주다01", "주다01", "주말02", "주소01", "주스", "주인01",
                "죽다01", "준비", "준비하다", "중국", "중국어", "중요하다02", "중학교", "중학생",
                "즐겁다", "지갑03", "지금03", "지금03", "지난달", "지난주", "지내다01", "지도03",
                "지우개", "지우다01", "지하", "지하철", "질문", "질문하다", "집01", "짜다03",
                "짧다", "쪽05", "찌개01", "찍다02", "차06", "차09", "참01", "창문", "찾다",
                "책01", "책상01", "처음", "천03", "천03", "천천히", "첫째", "첫째", "청바지",
                "청소06", "청소하다03", "초대06", "초대하다02", "초등학교", "초콜릿", "추다02",
                "축구04", "축하하다", "출발하다", "춤01", "춤추다", "춥다", "취미04", "층02",
                "치다02", "치마01", "치약", "친구02", "친절하다", "칠01", "칠십", "칠월", "칠판",
                "침대02", "칫솔", "카드", "카메라", "칼01", "캐나다", "커피", "컴퓨터", "컵",
                "켜다01", "코01", "콜라", "크다01", "크다01", "크리스마스", "키01", "타다02",
                "태권도", "태어나다", "택시", "테니스", "테이블", "텔레비전", "토요일", "티브이",
                "팀01", "파란색", "파티", "팔01", "팔03", "팔다", "팔십", "팔월", "퍼센트",
                "편지02", "포도06", "표04", "프랑스", "피곤하다", "피아노01", "피우다01", "피자",
                "필요", "필요하다", "하나", "하나", "하늘01", "하다01", "하다01", "하지만",
                "학교", "학년", "학생", "한01", "한강", "한국", "한국말", "한국어", "한글01",
                "한번", "한복", "한자02", "할머니", "할아버지", "함께", "항상", "해01", "해01",
                "핸드폰", "햄버거", "허리01", "형01", "호14", "호주", "호텔", "혼자01", "화06",
                "화요일", "화장실", "환자03", "회사04", "회의04", "후08", "휴일", "휴지02",
                "휴지통", "흰색", "힘01", "힘들다"
        );
    }

}
